Revit 2024 API
RadioButtonGroup Methods
The RadioButtonGroup type exposes the following members.
Methods
Name | Description
AddItem
Adds a new ToggleButton to the RadioButtonGroup.
AddItems
Adds new ToggleButtons to the RadioButtonGroup.
Equals
 Determines whether the specified Object is equal to the current Object.
 (Inherited from RibbonItem.)
GetContextualHelp
Gets the contextual help bound with this control.
 (Inherited from RibbonItem.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetItems
Gets the collection of ToggleButtons assigned to the RadioButtonGroup.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
SetContextualHelp
Sets the contextual help bound with this button.
 (Inherited from RibbonItem.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
RadioButtonGroup Class
Autodesk.Revit.UI Namespace